'''
저점을 찾는 스크립트
signal_any_drop 를 통해서 5일선이 20일선보다 아래에 있으면서 최근 -3%이 존재 + 오늘 3% 이상 상승
'''
import matplotlib
matplotlib.use("Agg")  # ✅ 비인터랙티브 백엔드 (창 안 띄움)
import os, sys
import numpy as np
import pandas as pd
from datetime import datetime, timedelta
import unicodedata
from pathlib import Path
import matplotlib.pyplot as plt
import requests
import time
from concurrent.futures import ThreadPoolExecutor, ProcessPoolExecutor, as_completed


# 자동 탐색 (utils.py를 찾을 때까지 위로 올라가 탐색)
here = Path(__file__).resolve()
for parent in [here.parent, *here.parents]:
    if (parent / "utils.py").exists():
        sys.path.insert(0, str(parent))
        break
else:
    raise FileNotFoundError("utils.py를 상위 디렉터리에서 찾지 못했습니다.")

from utils import get_kor_ticker_dict_list, add_technical_features, plot_candles_weekly, plot_candles_daily, \
    drop_sparse_columns, drop_trading_halt_rows, signal_any_drop, low_weekly_check


VOL_WINDOW = 30


def _col(df, ko: str, en: str):
    """한국/영문 칼럼 자동매핑: ko가 있으면 ko, 없으면 en을 반환"""
    if ko in df.columns: return ko
    return en


# 현재 실행 파일 기준으로 루트 디렉토리 경로 잡기
root_dir = os.path.dirname(os.path.abspath(__file__))  # 실행하는 파이썬 파일 위치(=루트)
pickle_dir = os.path.join(root_dir, 'pickle')

# pickle 폴더가 없으면 자동 생성 (이미 있으면 무시)
os.makedirs(pickle_dir, exist_ok=True)


# tickers = list(tickers_dict.keys())
# # 3퍼
# tickers = ['012630', '002710', '121600', '393890', '086520', '418550', '052400', '123410', '137400', '015760', '138930',
#            '060720', '002900', '003090', '033500', '017510', '396300', '079900', '023440', '032500', '002020', '323280',
#            '393210', '371950', '051600', '417200', '006650', '317330', '025900', '003030', '022100', '033790', '042660',
#            '086280', '307950', '298020', '234920', '289220', '078020', '030610', '069620', '194480', '217500', '003230',
#            '001720', '214430', '007820', '226400', '440320', '039020', '351330', '216080', '214450', '389140', '003380',
#            '000880', '489790', '042670', '100090', '085670', '065350', '114840', '317770', '035720', '220100', '460930',
#            '011200', '006120', '092730', '004140', '082800', '299660', '054950', '464080', '473980', '389260', '251970',
#            '079550', '037270', '036620', '023590', '032190', '376300', '141080', '377450', '439580', '000520', '000250',
#            '008490', '304100', '298380', '082270', '950160', '036420', '950210', '123690', '030520', '003530', '200670',
#            '019490', '358570', '388870', '161890', '290690', '041190', '065680', '257720', '094480', '377480', '026890',
#            '347860', '476080', '205500', '413640', '357550', '347700', '052710', '061040', '007460', '950140', '417840',
#            '448710', '103140', '499790', '293780', '083310', '089790', '388610', '372320', '001040', '009450', '389650',
#            '000320', '110990', '418420', '000400', '378800', '464500', '322310', '074600', '036200', '032680', '002790',
#            '078520', '012030', '060250', '036530', '251270', '128820', '109740', '201490', '099440', '451220', '036220',
#            '041830', '033230', '452160', '089590', '263860', '272450', '042000', '192250', '029460', '294570', '192400',
#            '259960', '425420', '053300', '092070', '315640', '104830', '425040', '474610', '003570', '007980', '082640',
#            '314930', '199480', '082920', '424960', '092040', '461300', '158430', '048530', '006220', '078340', '384470',
#            '054920', '482630', '014620', '095700', '445180', '213420', '429270', '265520', '114090', '025320', '099320',
#            '200710', '295310', '083500', '034230', '008770', '142760', '322780', '009070', '047400', '001045', '255220',
#            '475150', '420770', '045390', '083650', '365340', '025980', '041510', '122640', '105840', '091120', '094820',
#            '018470', '362320', '192820', '024720', '214420', '003350', '101170', '009540', '267270', '071970', '305090',
#            '178320', '475580', '217820', '053690', '180640', '399720', '005290', '474170', '059090', '452430', '005935',
#            '001820', '357780', '445090', '033160', '032820', '047560', '389020', '355150', '021240', '405100', '219130',
#            '009830']


# 4퍼
tickers = ['002710', '418550', '052400', '137400', '015760', '060720', '002900', '003090', '033500', '017510', '023440',
           '032500', '002020', '323280', '371950', '417200', '121600', '006650', '317330', '025900', '393210', '022100',
           '307950', '298020', '289220', '078020', '030610', '194480', '217500', '003230', '001720', '214430', '007820',
           '226400', '440320', '039020', '351330', '214450', '389140', '003380', '000880', '489790', '042660', '042670',
           '100090', '085670', '065350', '035720', '220100', '092730', '086280', '114840', '464080', '079550', '037270',
           '473980', '023590', '032190', '376300', '141080', '377450', '439580', '000520', '000250', '008490', '304100',
           '298380', '082270', '950160', '036420', '950210', '123690', '030520', '003530', '460930', '200670', '019490',
           '358570', '388870', '290690', '065680', '257720', '026890', '347860', '476080', '036620', '205500', '389260',
           '413640', '357550', '347700', '007460', '950140', '417840', '103140', '499790', '299660', '293780', '083310',
           '089790', '372320', '389650', '000320', '110990', '418420', '378800', '036200', '032680', '002790', '001040',
           '012030', '060250', '036530', '251270', '128820', '109740', '201490', '099440', '036220', '041190', '041830',
           '033230', '089590', '263860', '272450', '192250', '192400', '425420', '315640', '104830', '007980', '314930',
           '199480', '082920', '424960', '092040', '461300', '158430', '078520', '048530', '006220', '384470', '054920',
           '095700', '445180', '213420', '429270', '265520', '092070', '025320', '099320', '200710', '295310', '083500',
           '322310', '042000', '034230', '008770', '322780', '052710', '047400', '001045', '114090', '255220', '475150',
           '420770', '045390', '083650', '365340', '025980', '464500', '041510', '122640', '105840', '091120', '094820',
           '079900', '024720', '214420', '251970', '101170', '267270', '071970', '082640', '305090', '178320', '053690',
           '180640', '399720', '005290', '059090', '452430', '001820', '357780', '445090', '033160', '355150', '405100',
           '219130']



def process_one(idx, count, ticker, tickers_dict):
    stock_name = tickers_dict.get(ticker, 'Unknown Stock')
    # print(f"Processing {count+1}/{len(tickers)} : {stock_name} [{ticker}]")

    filepath = os.path.join(pickle_dir, f'{ticker}.pkl')
    if not os.path.exists(filepath):
        print(f"[idx={idx}] {ticker} 파일 없음")
        return

    df = pd.read_pickle(filepath)


    # idx만큼 뒤에서 자른다 (idx가 2라면 2일 전 데이터셋)
    if idx != 0:
        data = df[:-idx]
        remaining_data = df[len(df)-idx:]
    else:
        data = df
        remaining_data = None

    today = data.index[-1].strftime("%Y%m%d") # 마지막 인덱스
    if count == 0:
        # print(data)
        # print('─────────────────────────────────────────────────────────────')
        print(data.index[-1].date())
        # print('─────────────────────────────────────────────────────────────')


    ########################################################################

    closes = data['종가'].values
    trading_value = data['거래량'] * data['종가']


    # 데이터가 부족하면 패스
    if data.empty or len(data) < 70:
        # print(f"                                                        데이터 부족 → pass")
        return

    # 2차 생성 feature
    data = add_technical_features(data)

    # 결측 제거
    cleaned, cols_to_drop = drop_sparse_columns(data, threshold=0.10, check_inf=True, inplace=True)
    data = cleaned

    # 거래정지/이상치 행 제거
    data, removed_idx = drop_trading_halt_rows(data)


    if 'MA5' not in data.columns or 'MA20' not in data.columns:
        return

    # 마지막 일자 5일선은 20일선보다 낮아야 한다
    ma5_today = data['MA5'].iloc[-1]
    ma20_today = data['MA20'].iloc[-1]
    ma20_yesterday = data['MA20'].iloc[-2]

    if ma5_today >= ma20_today:
        return

    # 변화율 계산 (퍼센트로 보려면 * 100)
    ma20_chg_rate = (ma20_today - ma20_yesterday) / ma20_yesterday * 100

    # ★★★★★ 20일선 기울기 ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
    if ma20_chg_rate < -1.7:
        return


    # 직전 날까지의 마지막 3일 거래대금 평균
    today_tr_val = trading_value.iloc[-1]
    mean_prev3 = trading_value.iloc[:-1].tail(3).mean()
    chg_tr_val = (today_tr_val-mean_prev3)/mean_prev3*100

    # ★★★★★ 3거래일 평균 거래대금 5억보다 작으면 패스 ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
    if mean_prev3.round(1) / 100_000_000 < 5:
        return




    # ★★★★★ 거래대금 변동률, ++ 너무 크면 차익실현으로 하락 ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
    # -25/500: 46.46%
    # -22/500: 46.22%
    # -20/500: 46.64% ★★★★★
    # -20/400: 46.05%
    # -15/500: 45.97%
    # -10/500: 46.63%
    #  -5/500: 46.60%
    #   0/500: 46.27%
    if chg_tr_val < -20 or chg_tr_val > 500:
        return

    # ★★★★★ 오늘 15% 이상 오르면 패스 ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
    # 10: 44.74%
    # 11: 45.41%
    # 12: 45.81%
    # 13: 46.08%
    # 14: 46.38%
    # 15: 46.63% ★★★★★
    if data.iloc[-1]['등락률'] > 15:
        return

    # ★★★★★ 최근 20일 변동성 너무 낮으면 제외 (지루한 종목) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
    last20_ret = data['등락률'].tail(20)           # 등락률이 % 단위라고 가정
    last30_ret = data['등락률'].tail(30)
    vol20 = last20_ret.std()                      # 표준편차
    if vol20 < 1.5:                               # 필요하면 2.0~3.0 사이로 튜닝
        return

    # 4) 최근 20일 평균 등락률이 계속 마이너스인 종목 제외 (우하향 기는 느낌)
    mean_ret20 = last30_ret.mean()
    if mean_ret20 < -0.5:                           # -3% 이하면 장기 하락 기조
        return

    # 5) 최근 20일 중 양봉 비율이 30% 미만이면 제외 (계속 음봉 위주) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
    pos_ratio = (last30_ret > 0).mean()           # True 비율 => 양봉 비율
    if pos_ratio < 0.3:
        return











    # 최근 12일 5일선이 20일선보다 낮은데 3% 하락이 있으면서 오늘 3% 상승 ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
    # 변경점...  10일 +- 3일로 설정해봐야 할지도
    # 변경점... -2.5% +- 0.5% 설정해봐야 할지도
    # signal = signal_any_drop(data, 10, 4.0 ,-2.5)
    signal = signal_any_drop(data, 10, 4.0 ,-2.5)
    if not signal:
        return


    ########################################################################

    m_data = data[-80:] # 뒤에서 x개 (4개월 정도)


    m_closes = m_data['종가']
    m_max = m_closes.max()
    m_min = m_closes.min()
    m_current = m_closes[-1]

    r_data = remaining_data[:10]
    r_closes = r_data['종가']
    r_max = r_closes.max()

    m_chg_rate=(m_max-m_min)/m_min*100              # 최근 4개월 동안의 등락률
    c_chg_rate=(m_current-m_max)/m_max*100          # 최근 4개월 최고 대비 오늘 등락률 계산
    r_chg_rate = (r_max-m_current)/m_current*100    # 검증 등락률

    # ★★★★★ 최근 4개월 최고 대비 너무 내려 앉으면 패스 (보수적으로) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
    # -40: 46.64% (104/119)
    # -30  46.63% (89/99)

    # 0/40: 46.64%
    # 0/30: 46.63%
    # -5/40: 47.25%
    # -5/30: 47.34%
    # -10/40: 46.31%
    # -10/30: 46.24%

    # -15/40: 43.40%
    # if c_chg_rate > -5 or c_chg_rate < -30:
    if c_chg_rate < -40:
        return

    # ★★★★★ 최저 대비 최고 등락률, 최근 변동률 최소 기준: 횡보 or 심한 변동 제외 ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
    # 27/80: 46.25%
    # 25/80: 46.25%
    # 27/75: 45.89%
    # 25/75: 45.89%
    # 27/70: 44.91%
    # 25/70: 44.91%
    # 20/80: 46.43%
    # 30/80: 47.47%
    # 35/80: 47.71%
    # 40/80: 50.00% (65/65)
    # 45/80: 49.51%
    # 50/80: 51.85% (39/42)
    if m_chg_rate < 30 or m_chg_rate > 80:
        return


    result = low_weekly_check(m_data)
    if result["ok"]:

        # ★★★★★ 저번주 대비 이번주 증감률 -1%보다 낮으면 패스 (아직 하락 추세) ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
        if result["is_drop_more_than_minus3pct"]:
            return

        # ★★★★★ 지난주 대비 주봉 종가가 15% 이상 상승하면 패스 ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★
        # 15: 46.25%
        # 13: 45.49%
        # 11: 44.19%
        if result['pct_change'] * 100 > 15:
            return

        # ★★★★★ 4개월 첫주 대비 이번주 등락률: 너무 하락한것 제외 (목 돌아감) ++ 너무 상승하면 안올라감 (보수적으로 승률을 올리기 위해 30에서 20으로 내림)
        # -30: 46.25%
        # -25: 46.64%
        # -20: 46.53%
        # -25/30: 46.12%
        # -25/25: 45.41%
        # -25/20: 45.30%
        # -25/15: 43.27%
        # -25/10: 41.45%
        # if result['pct_vs_past_first'] > 30 or result['pct_vs_past_first'] < -25: ★★★★★★★★★★★★★★★★★★★★★★★★★
        # if result['pct_vs_past_first'] < -25:
        if result['pct_vs_past_first'] < -20:
            return

        # 50/-20/-20 조건 테스트 !!!!!!!!!!!!!!!!!!!!
        # if m_chg_rate < 60 and result['pct_vs_past_first'] < -17 and c_chg_rate < -19:
        # none:       47.09% (105/118)
        # 60/-20/-20: 47.85% (100/109)
        # if m_chg_rate > 60 and result['pct_vs_past_first'] < -20 and c_chg_rate < -20:
        #     return

        # 애매한 고점 근처 패턴 컷
        # if (-18 <= c_chg_rate <= -10 and
        #         result['pct_change']*100 >= 5 and
        #         data.iloc[-1]['등락률'] >= 5):
        #     return


        # ★★★★★ 오늘이 이미 거의 피크 느낌인 장대양봉
        # 오늘 등락률 9이상
        # 지난주 대비 등락률 9이상
        # 첫주 대비 이번주 등락률 5% 미만)
        # on > 40.91%
        # off > 41.35

        # 7/7/-10: 46.48%
        # 7/7/-15: 46.54%
        # 7/7/-20: 46.12%

        # 8/8/-15: 46.12%
        # 9/9/-15: 46.36%

        # 지난주 대비 등락률
        # 오늘등락률
        # 4개월 종가 최고 대비 오늘 등락률
        # 4개월 주봉 첫주 대비 이번주 등락률
        # if result['pct_change']*100 > 6 and \
        #     data.iloc[-1]['등락률'] > 6 and \
        #     c_chg_rate < -15 and \
        #     result['pct_vs_past_first'] < 5:
        #     return

        predict = '상승'
        if r_chg_rate < 8:
            predict = '미달'

        label = 1 if r_chg_rate >= 5 else 0  # 1: 성공(상승), 0: 미달

    ########################################################################

    row = {
        "ticker": ticker,
        "stock_name": stock_name,
        "label": label,
        "today" : str(data.index[-1].date()),
        "4_months_ago": str(m_data.index[0].date()),
        "ma20_chg_rate": round(ma20_chg_rate, 2),                # 20일선 기울기
        "vol20": round(vol20, 1),                                # 20일 평균 변동성
        "mean_ret20": round(mean_ret20, 1),                      # 20일 평균 등락률
        "pos_ratio": round(pos_ratio*100, 1),                    # 30일 평균 양봉비율
        "predict": predict,                                      # 상승/미달
        "mean_prev3": round(mean_prev3, 1),                      # 직전 3일 평균 거래대금
        "today_tr_val": round(today_tr_val, 1),                  # 오늘 거래대금
        "chg_tr_val": round(chg_tr_val, 1),                      # 거래대금 변동률
        "m_chg_rate": round(m_chg_rate, 1),                      # 4개월 종가 최저 대비 최고 등락률
        "c_chg_rate": round(c_chg_rate, 1),                      # 4개월 종가 최고 대비 오늘 등락률
        "pct_vs_first": round(result['pct_vs_past_first'], 1),   # 4개월 주봉 첫주 대비 이번주 등락률
        "pct_vs_lastweek": round(result['pct_change']*100, 1),   # 지난주 대비 등락률
        "today_pct": round(data.iloc[-1]['등락률'], 1),           # 오늘등락률
        "r_chg_rate": round(r_chg_rate, 1),                      # 검증 등락률
    }

    origin = df.copy()


    #연산하는 시간 걸리니 그래프 안그리면 패스
    # 2차 생성 feature
    origin = add_technical_features(origin)
    # 결측 제거
    o_cleaned, o_cols_to_drop = drop_sparse_columns(origin, threshold=0.10, check_inf=True, inplace=True)
    origin = o_cleaned
    # 거래정지/이상치 행 제거
    origin, o_removed_idx = drop_trading_halt_rows(origin)



    today_str = str(today)
    title = f"{today_str} {stock_name} [{ticker}] {round(data.iloc[-1]['등락률'], 2)}% Daily Chart - {predict} {r_chg_rate:.1f}%"
    final_file_name = f"{today} {stock_name} [{ticker}] {round(data.iloc[-1]['등락률'], 2)}%_{predict}.png"
    output_dir = 'D:\\5below20_test'
    final_file_path = os.path.join(output_dir, final_file_name)

    # 그래프 그릴 때 필요한 것만 모아서 리턴
    plot_job = {
        "origin": origin,
        "today": today_str,
        "title": title,
        "save_path": final_file_path,
    }

    return {
        "row": row,
        "plot_job": plot_job,
    }

if __name__ == "__main__":
    tickers_dict = get_kor_ticker_dict_list()

    print('signal_any_drop 를 통해서 5일선이 20일선보다 아래에 있으면서 최근 -3%이 존재 + 오늘 3% 이상 상승')

    nowTime = datetime.today().strftime("%Y-%m-%d %H:%M:%S")
    print(f'        {nowTime}: running 4_find_low_point.py...')
    start = time.time()   # 시작 시간(초)

    shortfall_cnt = 0
    up_cnt = 0
    rows=[]
    plot_jobs = []

    origin_idx = idx = 9
    workers = os.cpu_count()
    # with ThreadPoolExecutor(max_workers=workers) as executor:   # GIL(Global Interpreter Lock) >> I/O가 많은 경우
    with ProcessPoolExecutor(max_workers=workers) as executor:   # CPU를 진짜로 병렬로 돌리고 싶으면 >> CPU연산이 많은 경우
        futures = []

        while idx <= origin_idx + 29:
            idx += 1
            for count, ticker in enumerate(tickers):
                futures.append(executor.submit(process_one, idx, count, ticker, tickers_dict))

        # 완료된 것부터 하나씩 받아서 집계
        for f in as_completed(futures):
            try:
                res = f.result()
            except Exception as e:
                print("worker error:", e)
                continue

            if res is None:
                continue

            row = res["row"]
            plot_job = res["plot_job"]

            rows.append(row)
            plot_jobs.append(plot_job)

            if row["predict"] == "미달":
                shortfall_cnt += 1
            else:
                up_cnt += 1

    '''
    공통점 ① 대부분 "최근 20일 평균 등락률 ≥ 0%"
    공통점 ② 최근 20일 변동성 > 2.5% 수준
    공통점 ③ 4개월 최저 대비 최고 등락률이 40%~80% 구간에 몰림
    공통점 ④ 4개월 종가 최고 대비 오늘 등락률이 -40%보다 훨씬 위(상위권에 위치) >> 하락이 큰 만큼 회복도 크다 3할 타율
    공통점 ⑤ 주봉 첫주 대비 등락률이 매우 높은 경우가 다수
    공통점 ⑥ 대부분 '지난주 대비 등락률'이 5% 이상
    
    🔥 수익률 높은 종목의 6대 공통 패턴
    1) 최근 20일 평균 등락률 ≥ 0% 근처(약 -0.3% ~ +0.5%)
      계속 쌓이는 “조용한 상승 압력”
    2) 변동성 2.5~4.5%
      너무 낮지 않으면 상승 에너지가 있다.
    3) 4개월 최저 대비 최고 등락률 40~70%
      중기 추세가 이미 살아 있는 종목.
    4) 고점 대비 낙폭 -5% ~ -25%
      고점 대비 너무 빠진 종목은 검증 성과가 나쁨.
    5) 주봉 첫째주 대비 금주 등락률이 플러스
      주봉 추세가 우상향인 종목이 강했다.
    6) 지난주 대비 등락률 +5% 이상
      직전 1주일 모멘텀이 매우 중요했다.
      이 상승이 검증 수익률과 가장 직접적 상관이 높음.
    '''
    # 🔥 여기서 한 번에, 깔끔하게 출력
    for row in rows:
        print(f"\n {row['today']}   {row['stock_name']} [{row['ticker']}] {row['predict']}")
        # print(f"  4개월 전 날짜           : {row['4_months_ago']}")
        # print(f"  직전 3일 평균 거래대금  : {row['mean_prev3'] / 100_000_000:.0f}억")
        # print(f"  오늘 거래대금           : {row['today_tr_val'] / 100_000_000:.0f}억")
        # print(f"  거래대금 변동률         : {row['chg_tr_val']}%")
        # print(f"  20일선 기울기 ( > -1.7): {row['ma20_chg_rate']}")
        print(f"  최근 20일 변동성            ( > 1.5%): {row['vol20']}%")
        print(f"  최근 20일 평균 등락률            ( >= -0.5%): {row['mean_ret20']}%")      # -3% 보다 커야함
        # print(f"  최근 30일 중 양봉 비율      ( > 30%) : {row['pos_ratio']}%")
        print(f"  4개월 종가 최저 대비 최고 등락률 (30% ~ 80%): {row['m_chg_rate']}%" )    # 30 ~ 65 선호, 28-30이하 애매, 70이상 과열
        print(f"  4개월 종가 최고 대비 오늘 등락률   ( > -40%): {row['c_chg_rate']}%")     # -10(15) ~ -25(30) 선호, -10(15)이상은 아직 고점, -25(30) 아래는 미달일 경우가 있음
        print(f"  4개월 주봉 첫주 대비 이번주 등락률 ( > -20%): {row['pct_vs_first']}%")   # -15 ~ 20 선호, -20이하는 장기 하락 추세, 30이상은 급등 끝물
        print(f"  지난주 대비 등락률: {row['pct_vs_lastweek']}%")
        print(f"  오늘 등락률       : {row['today_pct']}%")
        print(f"  검증 등락률       : {row['r_chg_rate']}%")

    print('shortfall_cnt', shortfall_cnt)
    print('up_cnt', up_cnt)
    total_up_rate = up_cnt/(shortfall_cnt+up_cnt)*100
    print(f"저점 매수 스크립트 결과 : {total_up_rate:.2f}%")


    # CSV 저장
    pd.DataFrame(rows).to_csv('low_result.csv')
    df = pd.read_csv("low_result.csv")

    # # 성공/실패 평균 비교
    # print(df.groupby('success')[['m_chg_rate','c_chg_rate','pct_vs_first',
    #                              'pct_vs_lastweek','today_pct','chg_tr_val']].mean())
    #
    # # 예를 들어 c_chg_rate 분포 나눠보기
    # bins = [-40, -30, -25, -20, -15, -10]
    # df['cur_bin'] = pd.cut(df['c_chg_rate'], bins)
    #
    # print(df.pivot_table(index='cur_bin', columns='success', values='ticker', aggfunc='count'))

    success = df[df["label"] == 1]
    fail    = df[df["label"] == 0]

    # 최고 대비 오늘 등락률, 첫주 대비 이번주 등락률, 거래대금 변동률
    print(success[["c_chg_rate", "pct_vs_first", "chg_tr_val"]].mean())
    print(fail[["c_chg_rate", "pct_vs_first", "chg_tr_val"]].mean())




    # 싱글 스레드로 그래프 처리
    for job in plot_jobs:
        # 그래프 생성
        fig = plt.figure(figsize=(14, 16), dpi=150)
        gs = fig.add_gridspec(nrows=4, ncols=1, height_ratios=[3, 1, 3, 1])

        ax_d_price = fig.add_subplot(gs[0, 0])
        ax_d_vol   = fig.add_subplot(gs[1, 0], sharex=ax_d_price)
        ax_w_price = fig.add_subplot(gs[2, 0])
        ax_w_vol   = fig.add_subplot(gs[3, 0], sharex=ax_w_price)

        plot_candles_daily(job["origin"], show_months=6, title=f'{job["title"]}',
                            ax_price=ax_d_price, ax_volume=ax_d_vol, date_tick=5, today=job["today"])

        plot_candles_weekly(job["origin"], show_months=12, title="Weekly Chart",
                            ax_price=ax_w_price, ax_volume=ax_w_vol, date_tick=5)

        plt.tight_layout()
        # plt.show()

        # 파일 저장 (옵션)
        output_dir = 'D:\\5below20_test'
        os.makedirs(output_dir, exist_ok=True)

        plt.savefig(job["save_path"])
        plt.close()
    print('그래프 생성 완료')



    end = time.time()     # 끝 시간(초)
    elapsed = end - start

    print(f"총 소요 시간: {elapsed:.2f}초")
